# Ожидание стопа
from itertools import count

# Напишите программу, которая создает пустой список с использованием квадратных скобок []
# и добавляет в него элементы, запрашиваемые у пользователя.
# Ввод элементов должен продолжаться до тех пор, пока пользователь не введет слово "стоп".
# Затем программа должна вывести итоговый список.

# Напишите тут ваш код

result = []
while True:
    element = input("Введите элемент (или 'стоп' для завершения ввода): ")
    if element.lower() == 'стоп':
        break
    result.append(element)
print("Итоговый список:", result)