# Удаление элемента

# Напишите программу, которая создает список из 5 элементов, запрашивает у пользователя индекс элемента для удаления
# и удаляет элемент по этому индексу с использованием метода pop().
# Программа должна вывести обновленный список и удаленный элемент.
# Если индекс не существует, программа должна вывести сообщение об этом.

# Напишите тут ваш код

my_list = [0, 1, 2, 3, 4]
popped_element = ""

el = int(input("Элемент для удаления: "))
if el in my_list:
    popped_element = my_list.pop(el)
else:
    popped_element = ""
    print("Элемент не существует")

print(my_list)
print(popped_element)