# Сортировка без сортировки

# Напишите программу, которая создает список из 10 случайных чисел в диапазоне от 1 до 100.
# Затем программа должна создать копию этого списка и отсортировать копию по возрастанию, не изменяя исходный список.
# Программа должна вывести исходный и отсортированный списки.

# Напишите тут ваш код

from random import randrange

n = 10

my_list = [randrange(1, 101) for i in range(n)]
copy_list = list(my_list)
sorted_list = sorted(copy_list)

print(my_list)
print(sorted_list)