# Пользовательский кортеж

# Напишите программу, которая создает кортеж из произвольного количества элементов, запрашиваемых у пользователя.
# Затем программа должна вывести последний элемент кортежа.
# Если кортеж пустой, программа должна вывести сообщение об этом.

# Напишите тут ваш код

my_list = []
input_value = int(input("Укажите длину кортежа: "))

while len(my_list) < input_value:
    value = int(input("Введите значение: "))
    my_list.append(value)

new_tuple = tuple(my_list)


if len(new_tuple) == 0:
    print("Кортеж пустой")
else:
    print(f"Последний элемент: {new_tuple[-1]}")

