# Номер кортежа

# Напишите программу, которая создает кортеж из 5 элементов, запрашиваемых у пользователя.
# Затем программа должна запросить у пользователя индекс элемента и вывести значение элемента по этому индексу.
# Если индекс выходит за пределы кортежа, программа должна вывести соответствующее сообщение.

# Напишите тут ваш код

my_list = []

while len(my_list) < 5:
    value = input()
    my_list.append(value)

new_tuple = tuple(my_list)

ind = (int(input("Укажите индекс элемента: ")))
if -len(new_tuple) <= ind < len(new_tuple):
    print(new_tuple[ind])
else:
    print("Индекс выходит за пределы кортежа")
