# Самый главный кортеж

# Напишите программу, которая создает кортеж, содержащий несколько вложенных кортежей из целых чисел.
# Программа должна использовать цикл for для поиска максимального элемента во вложенных кортежах и вывести результат.

# Напишите тут ваш код

nested_tuples = ((1, 2, 3), (4, 5, 6), (7, 8, 9))

# Инициализируем переменную для хранения максимального значения
max_value = float('-inf')

for inner_tuple in nested_tuples:
    for num in inner_tuple:
        if num > max_value:
            max_value = num

print("Максимальное значение во вложенных кортежах:", max_value)