import random

# Этот метод возвращает случайное число с плавающей точкой между 0.0 и 1.0.
# Числа генерируются равномерно в этом диапазоне. Это означает, что каждое число внутри интервала имеет
# одинаковую вероятность выбора.

probability = random.random()
print("Случайная вероятность:", probability)

# Эта функция возвращает случайное целое число в диапазоне от a до b включительно. В отличие от random.random(),
# которая возвращает случайное число с плавающей запятой в диапазоне от 0 до 1, randint() используется, когда нужно
# выбрать целое число. Например, random.randint(1, 10) может вернуть любое целое число от 1 до 10,
# включая оба конечных значения.

dice_roll = random.randint(1, 6)  # Имитация броска игральной кости
print("Выпало число:", dice_roll)