# Мешанина
# Напишите программу, которая запрашивает у пользователя целое число, вещественное число и строку.
# Затем преобразуйте целое число в вещественное, вещественное число в строку, и строку в целое число (если это возможно).
# Выведите результаты преобразований и их типы. # Напишите тут ваш код

num1 = int(input("Введите число: "))
num2 = float(input("Введите число: "))
string1 = str(input("Введите значение: "))

num3 = float(num1)
num4 = str(num2)
num5 = int(string1)

print(num3)
print(type(num3))
print(num4)
print(type(num4))
print(num5)
print(type(num5))