# Сравнивать очень просто

# Напишите программу, которая запрашивает у пользователя два вещественных числа и сравнивает их с использованием
# допустимой погрешности epsilon.
# Выведите результат сравнения на экран.

# Напишите тут ваш код

import sys


# Запрашиваем два вещественных числа у пользователя
num1 = float(input("Введите первое вещественное число: "))
num2 = float(input("Введите второе вещественное число: "))

# Определяем допустимую погрешность
epsilon = 1e-9

# Сравниваем числа с учетом погрешности
if abs(num1 - num2) < epsilon:
    print("Числа равны")
else:
    print("Числа не равны")