# Максималист

# Напишите функцию find_max(a, b), которая принимает два числа в качестве аргументов и возвращает большее из них.
# Если числа равны, функция должна вернуть любое из них.
# Затем напишите программу, которая запрашивает у пользователя два числа, вызывает эту функцию и выводит результат.

# Напишите тут ваш код

def find_max(a, b):
    value = 0
    if a > b:
        value = a
    elif b > a:
        value = b
    else:
        value = a
    return value

print(find_max(int(input()), int(input())))