# Переменная z доступна только внутри функции inner().
#
# Переменная y доступна внутри функции outer() и во всех функциях, объявленных внутри неё.
#
# Переменная x доступна везде в текущем файле (модуле).

x = "global"  # Глобальная переменная

def outer():
    y = "outer local"  # Локальная переменная внешней функции
    def inner():
        z = "inner local"  # Локальная переменная вложенной функции
        print(x)  # Выводит "global"
        print(y)  # Выводит "outer local"
        print(z)  # Выводит "inner local"
    inner()

outer()

x = 10

def change_global():
    print(x)  # Это вызовет ошибку, так как x будет считаться локальной переменной после присвоения
    x = 20  # Тут создастся локальная переменная x
    print(x)  # Выведет 20 (идёт обращение к локальной переменной x)

change_global()
print(x)  # Выведет 10