# Чистим список

# Напишите программу, которая создает список из 10 случайных чисел в диапазоне от 1 до 20.
# Затем программа должна удалить из списка все четные числа с использованием цикла.
# Программа должна вывести исходный и обновленный списки.

# Напишите тут ваш код

from random import randrange

n = 10

my_list = [randrange(1, 20) for i in range(n)]


# Удаляем все четные числа из списка
filtered_list = []
for num in my_list:
    if num % 2 != 0:
        filtered_list.append(num)

print("Обновленный список:", filtered_list)
